Jdubz/Adafruit_nRF52_Bootloader/src/main.c
  // Save bootloader version to pre-defined register, retrieved by application
  // TODO move to CF2
  BOOTLOADER_VERSION_REGISTER = (MK_BOOTLOADER_VERSION);

  board_init();
  bootloader_init();

  PRINTF("Bootloader Start\r\n");

  led_state(STATE_BOOTLOADER_STARTED);

  // When updating SoftDevice, bootloader will reset before swapping SD
  if (bootloader_dfu_sd_in_progress())
  {
    led_state(STATE_WRITING_STARTED);

    bootloader_dfu_sd_update_continue();
    bootloader_dfu_sd_update_finalize();

    led_state(STATE_WRITING_FINISHED);
  }

  // Check all inputs and enter DFU if needed
  // Return when DFU process is complete (or not entered at all)
  check_dfu_mode();

  // Reset peripherals
  board_teardown();

  /* Jump to application if valid
   * "Master Boot Record and SoftDevice initializaton procedure"
   * - SD_MBR_COMMAND_INIT_SD (if not already)
   * - sd_softdevice_disable()
   * - sd_softdevice_vector_table_base_set(APP_ADDR)
   * - jump to App reset
   */

  if (bootloader_app_is_valid() && !bootloader_dfu_sd_in_progress())
  {
    PRINTF("App is valid\r\n");
    if ( is_sd_existed() )
    {
      // MBR forward IRQ to SD (if not already)
      if ( !_sd_inited ) mbr_init_sd();

      // Make sure SD is disabled
      sd_softdevice_disable();
    }

    // clear in case we kept DFU_DBL_RESET_APP there
    (*dbl_reset_mem) = 0;

    // start application
    bootloader_app_start();
  }

#ifdef DEFAULT_TO_OTA_DFU
  if (!bootloader_app_is_valid()) {
    NRF_POWER->GPREGRET = DFU_MAGIC_OTA_RESET;
  }
#endif

  NVIC_SystemReset();
}

/*------------- QSPI Staged OTA Apply -------------*/
/* Firmware is staged in external QSPI flash (P25Q16H, 2 MB) by the running
 * application. When the app sets GPREGRET=0xCC and resets, the bootloader
 * reads the staged firmware from QSPI, validates CRC, and copies to internal
 * flash. If validation fails, the old application boots normally.
 *
 * QSPI layout:
 *   0x000000: 8-byte header {uint32 size, uint16 crc16, uint16 magic=0xB10C}
 *   0x001000: Firmware binary (4KB-aligned)
 *
 * Safety: GPREGRET is cleared BEFORE any QSPI operations. If this code
 * crashes, the device resets with GPREGRET=0 and boots the old app.
 * Internal flash is only erased after the QSPI data passes CRC validation.
 */
#include "nrfx_qspi.h"
#include "crc16.h"

#define QSPI_STAGING_HEADER_ADDR    0x000000
#define QSPI_STAGING_FIRMWARE_ADDR  0x001000
#define QSPI_STAGING_MAGIC          0xB10C

typedef struct __attribute__((packed)) {
  uint32_t size;
  uint16_t crc16;
  uint16_t magic;
} qspi_staging_header_t;

static bool qspi_apply_staged_firmware(void)
{
  // XIAO nRF52840 Sense QSPI pins (physical P0.xx, NOT Arduino logical pins)
  nrfx_qspi_config_t qcfg = {
    .xip_offset = 0,
    .pins = {
      .sck_pin = NRF_GPIO_PIN_MAP(0, 21),
      .csn_pin = NRF_GPIO_PIN_MAP(0, 25),
      .io0_pin = NRF_GPIO_PIN_MAP(0, 20),
      .io1_pin = NRF_GPIO_PIN_MAP(0, 24),
      .io2_pin = NRF_GPIO_PIN_MAP(0, 22),
      .io3_pin = NRF_GPIO_PIN_MAP(0, 23),
    },
    .prot_if = {
      .readoc   = NRF_QSPI_READOC_READ4O,
      .writeoc  = NRF_QSPI_WRITEOC_PP4O,
      .addrmode = NRF_QSPI_ADDRMODE_24BIT,
    },
    .phy_if = {
      .sck_delay = 10,
      .dpmen     = false,
      .spi_mode  = NRF_QSPI_MODE_0,
      .sck_freq  = NRF_QSPI_FREQ_32MDIV16,  // 2 MHz (conservative)
    },
    .irq_priority = 7,
  };

  // Init QSPI peripheral (polling mode — no IRQ handler)
  if (nrfx_qspi_init(&qcfg, NULL, NULL) != NRFX_SUCCESS) {
    PRINTF("QSPI init failed\r\n");
    return false;
  }

  // Read staging header
  qspi_staging_header_t hdr __attribute__((aligned(4)));
  if (nrfx_qspi_read(&hdr, sizeof(hdr), QSPI_STAGING_HEADER_ADDR) != NRFX_SUCCESS) {
    PRINTF("QSPI header read failed\r\n");
    nrfx_qspi_uninit();
    return false;
  }

  // Validate header
  // Validate header. Hardcoded upper bound (820 KB = 0xCD000) as safety net
  // in case DFU_IMAGE_MAX_SIZE_FULL is corrupted by bad SoftDevice info struct.
  if (hdr.magic != QSPI_STAGING_MAGIC || hdr.size == 0 ||
      hdr.size > DFU_IMAGE_MAX_SIZE_FULL || hdr.size > 0xCD000) {
    PRINTF("QSPI header invalid (magic=0x%04X size=%lu)\r\n", hdr.magic, hdr.size);
    nrfx_qspi_uninit();
    return false;
  }

  PRINTF("QSPI staged: %lu bytes, CRC=0x%04X\r\n", hdr.size, hdr.crc16);

  // Read firmware from QSPI and compute CRC16 incrementally
  static uint8_t chunk_buf[4096] __attribute__((aligned(4)));
  uint16_t crc = 0xFFFF;
  uint32_t remaining = hdr.size;
  uint32_t qspi_offset = QSPI_STAGING_FIRMWARE_ADDR;

  while (remaining > 0) {
    uint32_t chunk_len = (remaining > sizeof(chunk_buf)) ? sizeof(chunk_buf) : remaining;
    // Round up to 4-byte alignment for QSPI read
    uint32_t read_len = (chunk_len + 3) & ~3;

    if (nrfx_qspi_read(chunk_buf, read_len, qspi_offset) != NRFX_SUCCESS) {
      PRINTF("QSPI read failed at 0x%08lX\r\n", qspi_offset);
      nrfx_qspi_uninit();
      return false;
    }

    crc = crc16_compute(chunk_buf, chunk_len, &crc);
    qspi_offset += chunk_len;
    remaining -= chunk_len;
  }

  // Validate CRC
  if (crc != hdr.crc16) {
    PRINTF("QSPI CRC mismatch: computed=0x%04X expected=0x%04X\r\n", crc, hdr.crc16);
    nrfx_qspi_uninit();
    return false;
  }

  PRINTF("QSPI CRC OK — applying to internal flash\r\n");
  led_state(STATE_WRITING_STARTED);

  // === POINT OF NO RETURN: erase internal app flash and copy from QSPI ===
  remaining = hdr.size;
  qspi_offset = QSPI_STAGING_FIRMWARE_ADDR;
  uint32_t flash_addr = CODE_REGION_1_START;

  while (remaining > 0) {
    uint32_t chunk_len = (remaining > sizeof(chunk_buf)) ? sizeof(chunk_buf) : remaining;
    uint32_t read_len = (chunk_len + 3) & ~3;

    if (nrfx_qspi_read(chunk_buf, read_len, qspi_offset) != NRFX_SUCCESS) {
      PRINTF("QSPI re-read failed at 0x%08lX\r\n", qspi_offset);
      break;  // Can't recover — flash is partially written. SafeBootWatchdog will handle.
    }

    // flash_nrf5x_write handles page erase + write with caching
    flash_nrf5x_write(flash_addr, chunk_buf, chunk_len, true);

