Jdubz/Adafruit_nRF52_Bootloader/src/main.c
    flash_addr += chunk_len;
    qspi_offset += chunk_len;
    remaining -= chunk_len;
  }

  // Flush any remaining cached page
  flash_nrf5x_flush(true);

  // Update bootloader settings so bootloader_app_is_valid() returns true
  bootloader_settings_t settings;
  memset(&settings, 0, sizeof(settings));
  settings.bank_0 = BANK_VALID_APP;
  settings.bank_0_crc = hdr.crc16;
  settings.bank_0_size = hdr.size;
  settings.bank_1 = BANK_INVALID_APP;

  nrfx_nvmc_page_erase(BOOTLOADER_SETTINGS_ADDRESS);
  nrfx_nvmc_words_write(BOOTLOADER_SETTINGS_ADDRESS,
                        (uint32_t const *)&settings,
                        sizeof(settings) / sizeof(uint32_t));

  // Clear staging header by erasing the entire header sector (4 KB).
  // This sets all bits to 0xFF, so magic becomes 0xFFFF (invalid).
  // A sector erase is more reliable than a partial page write — the
  // nrfx_qspi_write of zeros was observed to fail silently on some boots,
  // leaving magic=0xB10C and causing harmless but wasteful re-application.
  nrfx_qspi_erase(NRF_QSPI_ERASE_LEN_4KB, QSPI_STAGING_HEADER_ADDR);

  nrfx_qspi_uninit();

  PRINTF("QSPI OTA applied: %lu bytes to 0x%08lX\r\n", hdr.size, (uint32_t)CODE_REGION_1_START);
  led_state(STATE_WRITING_FINISHED);

  return true;
}

static void check_dfu_mode(void)
{
  uint32_t const gpregret = NRF_POWER->GPREGRET;

  // QSPI staged OTA: apply pre-validated firmware from external QSPI flash.
  // Check RAM magic first (reliable through USB hub resets), then GPREGRET.
  bool qspi_requested = false;
  if (*dbl_reset_mem == DFU_RAM_MAGIC_QSPI) {
    (*dbl_reset_mem) = 0;  // Clear immediately (one-shot)
    qspi_requested = true;
    PRINTF("QSPI OTA apply requested (RAM magic)\r\n");
  } else if (gpregret == DFU_MAGIC_QSPI_APPLY) {
    NRF_POWER->GPREGRET = 0;
    qspi_requested = true;
    PRINTF("QSPI OTA apply requested (GPREGRET)\r\n");
  }
  if (qspi_requested) {
    if (qspi_apply_staged_firmware()) {
      return;
    }
    PRINTF("QSPI apply failed — falling through to normal boot\r\n");
  }

  // RAM-based bootloader entry: check DFU_DBL_RESET_MEM for firmware-written
  // magic values. This bypasses GPREGRET entirely — RAM at 0x20007F7C survives
  // system reset (same address used by double-reset detection). Firmware writes
  // these values before NVIC_SystemReset() as a reliable alternative to GPREGRET
  // which can be cleared by USB hub port power-cycling during reset.
  uint32_t const ram_magic = *dbl_reset_mem;
  bool ram_uf2 = false;
  bool ram_ota = false;

  if (ram_magic == DFU_RAM_MAGIC_UF2) {
    (*dbl_reset_mem) = 0;  // Clear immediately (one-shot)
    ram_uf2 = true;
    PRINTF("RAM magic: UF2 mode requested\r\n");
  } else if (ram_magic == DFU_RAM_MAGIC_BLE) {
    (*dbl_reset_mem) = 0;
    ram_ota = true;
    PRINTF("RAM magic: BLE DFU mode requested\r\n");
  }

  // SD is already Initialized in case of BOOTLOADER_DFU_OTA_MAGIC
  _sd_inited = (gpregret == DFU_MAGIC_OTA_APPJUM);

  // Start Bootloader in BLE OTA mode
  _ota_dfu = ram_ota || (gpregret == DFU_MAGIC_OTA_APPJUM) || (gpregret == DFU_MAGIC_OTA_RESET);

  // Serial only mode
  bool const serial_only_dfu = (gpregret == DFU_MAGIC_SERIAL_ONLY_RESET);
  bool const uf2_dfu         = ram_uf2 || (gpregret == DFU_MAGIC_UF2_RESET);
  bool const dfu_skip        = (gpregret == DFU_MAGIC_SKIP);

  bool const reason_reset_pin = (NRF_POWER->RESETREAS & POWER_RESETREAS_RESETPIN_Msk) ? true : false;

  // start either serial, uf2 or ble
  bool dfu_start = _ota_dfu || serial_only_dfu || uf2_dfu ||
                    (((*dbl_reset_mem) == DFU_DBL_RESET_MAGIC) && reason_reset_pin);

  // Clear GPREGRET if it is our values
  if (dfu_start || dfu_skip) NRF_POWER->GPREGRET = 0;

  // skip dfu entirely
  if (dfu_skip) return;

  /*------------- Determine DFU mode (Serial, OTA, FRESET or normal) -------------*/
  // DFU button pressed
  dfu_start = dfu_start || button_pressed(BUTTON_DFU);

  // DFU + FRESET are pressed --> OTA
  _ota_dfu = _ota_dfu  || ( button_pressed(BUTTON_DFU) && button_pressed(BUTTON_FRESET) ) ;

  bool const valid_app = bootloader_app_is_valid();
  bool const just_start_app = valid_app && !dfu_start && (*dbl_reset_mem) == DFU_DBL_RESET_APP;

  if (!just_start_app && APP_ASKS_FOR_SINGLE_TAP_RESET()) dfu_start = 1;

#ifdef DEFAULT_TO_OTA_DFU
  /* Force BLE OTA DFU only for "silent" triggers: invalid app, or
   * app-initiated DFU without an explicit UF2/serial magic. Do NOT
   * coerce physical-user DFU entry (double-tap reset, DFU button,
   * APP_ASKS_FOR_SINGLE_TAP_RESET) — those have always meant
   * "give me USB UF2". Breaking them would remove the wired-recovery
   * escape hatch this bootloader's reset button is designed to provide.
   *
   * Use case split:
   *   sealed sculpture device, mid-DFU corruption → !valid_app → BLE DFU
   *   accessible device, user double-taps reset    → UF2 mode (preserved)
   */
  bool const physical_user_dfu =
      (((*dbl_reset_mem) == DFU_DBL_RESET_MAGIC) && reason_reset_pin) ||
      button_pressed(BUTTON_DFU) ||
      APP_ASKS_FOR_SINGLE_TAP_RESET();
  if ((dfu_start || !valid_app) && !serial_only_dfu && !uf2_dfu && !physical_user_dfu) {
    _ota_dfu = 1;
  }
#endif

  // App mode: Double Reset detection or DFU startup for nrf52832
  if ( ! (just_start_app || dfu_start || !valid_app) )
  {
#ifdef NRF52832_XXAA
    /* Even DFU is not active, we still force an 1000 ms dfu serial mode when startup
     * to support auto programming from Arduino IDE
     *
     * Note: Double Reset WONT work with nrf52832 since all its SRAM got cleared with GPIO reset.
     */
    bootloader_dfu_start(false, DFU_SERIAL_STARTUP_INTERVAL, false);
#else
    // Note: RESETREAS is not clear by bootloader, it should be cleared by application upon init()
    if (reason_reset_pin)
    {
      // Register our first reset for double reset detection
      (*dbl_reset_mem) = DFU_DBL_RESET_MAGIC;

      // if RST is pressed during this delay (double reset)--> if will enter dfu
      NRFX_DELAY_MS(DFU_DBL_RESET_DELAY);
    }
#endif
  }

